W6D3/testing_rails_setup/app/controllers/superheroes_controller.rb

SELECT "superheros".* FROM "superheros"
---
    def index
        render json: Superhero.all

INSERT INTO "superheros" ("name", "power", "secret_identity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Superman"], ["power", 40], ["secret_identity", "Bruce Something"], ["created_at", "2020-06-17 01:01:26.048249"], ["updated_at", "2020-06-17 01:01:26.048249"]]
---
    def create
        superhero = Superhero.new(superhero_params)

        if superhero.save